app/views/profiles/_listShow.html.haml

  %div.col-auto
    -if current_user.profile.followed.include?(profile)
      -follow = Follow.find_by(follower_id: current_user.profile.id, followed_id: profile.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" INNER JOIN "follows" ON "profiles"."id" = "follows"."followed_id" WHERE "follows"."follower_id" = ?  [["follower_id", 2]]
SELECT  "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followed_id" = ? LIMIT ?  [["follower_id", 2], ["followed_id", 1], ["LIMIT", 1]]