app/views/profiles/show.html.haml

SELECT "posts".* FROM "posts" WHERE "posts"."profile_id" = ?  [["profile_id", 2]]
---
  .row
    -@profile.posts.each do |post|