app/views/comments/_show.html.haml

      %div.row
        = comment.profile.first_name
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]