app/views/comments/_show.html.haml

UPDATE "comments" SET "comment_text" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment_text", "test"], ["updated_at", "2020-12-09 18:34:38.234938"], ["id", 27]]
---
      .col-auto
        =button_to t('.update'), comment, method: :put,remote: true, params: {comment: {comment_text: comment.id}}, class: 'btn btn-secondary', id: "commentUpdate", commentID: comment.id
      .col-auto