app/views/comments/create.js.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
addComment = $("#addCommentRow")
$("#postContainer<%=@comment.post.id%>").find("#addCommentRow").remove()