app/views/shared/_header.html.haml

        -if user_signed_in?
          -if Profile.where(user: current_user).size() == 1
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "profiles" WHERE "profiles"."user_id" = ?  [["user_id", 1]]

              %a.nav-link.text-white{:href => profile_path(current_user.profile)}
                = current_user.profile.first_name
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]