app/views/posts/_postComments.html.haml

  -x = 0
  -post.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]

-else
  -post.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]