app/views/posts/_showPost.html.haml

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    %div.col-auto
      = post.profile.first_name

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
    -x = 0
    -post.comments.each do |comment|

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
  -else
    -post.comments.each do |comment|