app/views/posts/_show.html.haml

    %div.col-auto
      = post.profile.first_name
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]