app/views/posts/index.html.haml

        %td
          = post.profile.first_name
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]