app/views/posts/show.html.haml

    %div.col
      = @post.profile.first_name
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      %image{'source' => @post.image_url}
  -@post.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]

          %div.row
            = comment.profile.first_name
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]