app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "profile_id", "comment_text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 4], ["profile_id", 1], ["comment_text", "sdfsdf"], ["created_at", "2020-12-08 16:24:31.858388"], ["updated_at", "2020-12-08 16:24:31.858388"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.profile = current_user.profile
    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "comment_text" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment_text", "test"], ["updated_at", "2020-12-09 18:34:38.234938"], ["id", 27]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)