app/controllers/follows_controller.rb

INSERT INTO "follows" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2020-12-12 04:03:51.393138"], ["updated_at", "2020-12-12 04:03:51.393138"]]
---
  def create
    @follow = Follow.new(follow_params)
    respond_to do |format|
      if @follow.save

DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 25]]
---
  def destroy
    @follow.destroy

SELECT  "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
---
    def set_follow
      @follow = Follow.find(params[:id])