app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (post_text like '%edh%')
---
  def index
    @posts = Post.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("profile_id", "title", "post_text", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["profile_id", 1], ["title", "jeff"], ["post_text", "my name is jeff "], ["image_url", ""], ["created_at", "2020-11-25 13:04:05.634685"], ["updated_at", "2020-11-25 13:04:05.634685"]]
---
  def create
    @post = Post.new(post_params)
    @post.profile = Profile.find_by(user: current_user)
    respond_to do |format|
      if @post.save