app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user = current_user
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("first_name", "surname", "dob", "bio", "picture_url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "bio" = ?, "picture_url" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["bio", "My name is james. I created this website using ruby on rails."], ["picture_url", ""], ["updated_at", "2020-12-12 17:48:15.174283"], ["id", 1]]