app/models/post.rb

SELECT "posts".* FROM "posts" WHERE (post_text like '%edh%')
---
   scope :search, ->(query) {
     Post.where("title like ?","%#{query}%") + Post.where("post_text like ?","%#{query}%")